iNavFlight/inav/lib/main/STM32F7/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="CM33_BE_ARMCC">
      <description>Cortex-M33 processor based device in big endian mode for the Arm Compiler</description>
      <require condition="CM33_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_FP_ARMCC">
      <description>Cortex-M33 processor based device using Floating Point Unit for the Arm Compiler</description>
      <require condition="CM33_FP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_FP_LE_ARMCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in little endian mode for the Arm Compiler</description>
      <require condition="CM33_FP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_FP_BE_ARMCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in big endian mode for the Arm Compiler</description>
      <require condition="CM33_FP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_NODSP_NOFPU_ARMCC">
      <description>Cortex-M33 processor, no DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_ARMCC">
      <description>Cortex-M33 processor, DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_DSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_NODSP_SP_ARMCC">
      <description>Cortex-M33 processor, no DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_DSP_SP_ARMCC">
      <description>Cortex-M33 processor, DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_DSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_NODSP_NOFPU_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, no DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_DSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_NODSP_SP_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, no DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_SP_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_DSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MBL_ARMCC">
      <description>Armv8-M Baseline processor based device for the Arm Compiler</description>
      <require condition="ARMv8MBL"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MBL_LE_ARMCC">
      <description>Armv8-M Baseline processor based device in little endian mode for the Arm Compiler</description>
      <require condition="ARMv8MBL_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MBL_BE_ARMCC">
      <description>Armv8-M Baseline processor based device in big endian mode for the Arm Compiler</description>
      <require condition="ARMv8MBL_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_ARMCC">
      <description>Armv8-M Mainline processor based device for the Arm Compiler</description>
      <require condition="ARMv8MML"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_LE_ARMCC">
      <description>Armv8-M Mainline processor based device in little endian mode for the Arm Compiler</description>
      <require condition="ARMv8MML_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_BE_ARMCC">
      <description>Armv8-M Mainline processor based device in big endian mode for the Arm Compiler</description>
      <require condition="ARMv8MML_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_FP_ARMCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit for the Arm Compiler</description>
      <require condition="ARMv8MML_FP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_FP_LE_ARMCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in little endian mode for the Arm Compiler</description>
      <require condition="ARMv8MML_FP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_FP_BE_ARMCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in big endian mode for the Arm Compiler</description>
      <require condition="ARMv8MML_FP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_NODSP_NOFPU_ARMCC">
      <description>Armv8-M Mainline, no DSP, no FPU, Arm Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_ARMCC">
      <description>Armv8-M Mainline, DSP, no FPU, Arm Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_ARMCC">
      <description>Armv8-M Mainline, no DSP, SP FPU, Arm Compiler</description>
      <require condition="ARMv8MML_NODSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_ARMCC">
      <description>Armv8-M Mainline, DSP, SP FPU, Arm Compiler</description>
      <require condition="ARMv8MML_DSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
