iNavFlight/inav/lib/main/STM32F7/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="CM7_SP_BE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in big endian mode for the GCC Compiler</description>
      <require condition="CM7_SP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_DP_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) for the GCC Compiler</description>
      <require condition="CM7_DP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_DP_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in little endian mode for the GCC Compiler</description>
      <require condition="CM7_DP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_DP_BE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in big endian mode for the GCC Compiler</description>
      <require condition="CM7_DP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM23_GCC">
      <description>Cortex-M23 processor based device for the GCC Compiler</description>
      <require condition="CM23"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM23_LE_GCC">
      <description>Cortex-M23 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM23_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM23_BE_GCC">
      <description>Cortex-M23 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM23_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_GCC">
      <description>Cortex-M33 processor based device for the GCC Compiler</description>
      <require condition="CM33"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_LE_GCC">
      <description>Cortex-M33 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM33_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_BE_GCC">
      <description>Cortex-M33 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM33_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_FP_GCC">
      <description>Cortex-M33 processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="CM33_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_FP_LE_GCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="CM33_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_FP_BE_GCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="CM33_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_NODSP_NOFPU_GCC">
      <description>CM33, no DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_GCC">
      <description>CM33, DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_DSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_NODSP_SP_GCC">
      <description>CM33, no DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_DSP_SP_GCC">
      <description>CM33, DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_DSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_NODSP_NOFPU_LE_GCC">
      <description>CM33, little endian, no DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_LE_GCC">
      <description>CM33, little endian, DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_DSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_NODSP_SP_LE_GCC">
      <description>CM33, little endian, no DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_SP_LE_GCC">
      <description>CM33, little endian, DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_DSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MBL_GCC">
      <description>Armv8-M Baseline processor based device for the GCC Compiler</description>
      <require condition="ARMv8MBL"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="ARMv8MBL_LE_GCC">
      <description>Armv8-M Baseline processor based device in little endian mode for the GCC Compiler</description>
      <require condition="ARMv8MBL_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MBL_BE_GCC">
      <description>Armv8-M Baseline processor based device in big endian mode for the GCC Compiler</description>
      <require condition="ARMv8MBL_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_GCC">
      <description>Armv8-M Mainline processor based device for the GCC Compiler</description>
      <require condition="ARMv8MML"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="ARMv8MML_LE_GCC">
      <description>Armv8-M Mainline processor based device in little endian mode for the GCC Compiler</description>
      <require condition="ARMv8MML_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_BE_GCC">
      <description>Armv8-M Mainline processor based device in big endian mode for the GCC Compiler</description>
      <require condition="ARMv8MML_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_FP_GCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="ARMv8MML_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="ARMv8MML_FP_LE_GCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="ARMv8MML_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_FP_BE_GCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="ARMv8MML_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_NODSP_NOFPU_GCC">
      <description>Armv8-M Mainline, no DSP, no FPU, GCC Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_GCC">
      <description>Armv8-M Mainline, DSP, no FPU, GCC Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
