iNavFlight/inav/lib/main/STM32F7/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="ARMv8MML_NODSP_SP_GCC">
      <description>Armv8-M Mainline, no DSP, SP FPU, GCC Compiler</description>
      <require condition="ARMv8MML_NODSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_GCC">
      <description>Armv8-M Mainline, DSP, SP FPU, GCC Compiler</description>
      <require condition="ARMv8MML_DSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="ARMv8MML_NODSP_NOFPU_LE_GCC">
      <description>Armv8-M Mainline, little endian, no DSP, no FPU, GCC Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_LE_GCC">
      <description>Armv8-M Mainline, little endian, DSP, no FPU, GCC Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_LE_GCC">
      <description>Armv8-M Mainline, little endian, no DSP, SP FPU, GCC Compiler</description>
      <require condition="ARMv8MML_NODSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_LE_GCC">
      <description>Armv8-M Mainline, little endian, DSP, SP FPU, GCC Compiler</description>
      <require condition="ARMv8MML_DSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <!-- IAR compiler -->
    <condition id="CA_IAR">
      <description>Cortex-A5, Cortex-A7 or Cortex-A9 processor based device for the IAR Compiler</description>
      <require condition="ARMv7-A Device"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="CM0_IAR">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device for the IAR Compiler</description>
      <require condition="CM0"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM0_LE_IAR">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM0_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM0_BE_IAR">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM0_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM1_IAR">
      <description>Cortex-M1 based device for the IAR Compiler</description>
      <require condition="CM1"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM1_LE_IAR">
      <description>Cortex-M1 based device in little endian mode for the IAR Compiler</description>
      <require condition="CM1_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM1_BE_IAR">
      <description>Cortex-M1 based device in big endian mode for the IAR Compiler</description>
      <require condition="CM1_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM3_IAR">
      <description>Cortex-M3 or SC300 processor based device for the IAR Compiler</description>
      <require condition="CM3"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM3_LE_IAR">
      <description>Cortex-M3 or SC300 processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM3_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM3_BE_IAR">
      <description>Cortex-M3 or SC300 processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM3_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM4_IAR">
      <description>Cortex-M4 processor based device for the IAR Compiler</description>
      <require condition="CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM4_LE_IAR">
      <description>Cortex-M4 processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM4_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_BE_IAR">
      <description>Cortex-M4 processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM4_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM4_FP_IAR">
      <description>Cortex-M4 processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="CM4_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM4_FP_LE_IAR">
      <description>Cortex-M4 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="CM4_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_FP_BE_IAR">
      <description>Cortex-M4 processor based device using Floating Point Unit in big endian mode for the IAR Compiler</description>
      <require condition="CM4_FP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_IAR">
      <description>Cortex-M7 processor based device for the IAR Compiler</description>
      <require condition="CM7"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM7_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_BE_IAR">
      <description>Cortex-M7 processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM7_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_FP_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="CM7_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7_FP_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="CM7_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
